//Напишите программу, которая принимает на вход число 
//и проверяет , кратно ли оно одновременно 7 и 23.

// string cat = "Big Cat";

// if (cat.Contains("Big") && cat.Contains("Cat"))
// {
//   Console.WriteLine("Yes");
// }

